app/Controllers/Home.php

INSERT INTO `ventas` (`id_usuario`, `id_paquete`, `cantidad`, `fecha_venta`) VALUES ('6', '9', 1, '2025-10-22 17:07:58')
---
    private function registrarVenta($paqueteId, $userId, $cantidad = 1)
    {
        $db = \Config\Database::connect();
        $db->table('ventas')->insert([
            'id_usuario' => $userId,
            'id_paquete' => $paqueteId,
            'cantidad' => $cantidad,
            'fecha_venta' => date('Y-m-d H:i:s')
        ]);