app/Models/PaquetesModel.php

SELECT *
FROM `paquetes`
---
    public function getPaquetes()
    {
        return $this->findAll();

SELECT *
FROM `paquetes`
WHERE `paquetes`.`id` = '9'
---
    public function verificarStock($id, $cantidad = 1)
    {
        $paquete = $this->find($id);

UPDATE `paquetes` SET `stock` = 98
WHERE `paquetes`.`id` IN ('9')
---
    public function descontarStock($id, $cantidad = 1)
    {
        $paquete = $this->find($id);
        if ($paquete && $paquete['stock'] >= $cantidad) {
            return $this->update($id, ['stock' => $paquete['stock'] - $cantidad]);

SELECT *
FROM `paquetes`
---
    public function getPaquetesConInfoAdicional($userId = null)
    {
        $paquetes = $this->findAll();

SELECT COUNT(*) AS `numrows`
FROM `ventas`
WHERE `id_usuario` = '5'
---
    private function esClienteFrecuente($userId)
    {
        $db = \Config\Database::connect();
        $compras = $db->table('ventas')
                     ->where('id_usuario', $userId)
                     ->countAllResults();

SELECT *
FROM `paquetes`
WHERE `es_oferta` = 1
---
    public function getOfertas()
    {
        return $this->where('es_oferta', true)->findAll();

SELECT *
FROM `paquetes`
WHERE `es_oferta` != 1
OR `es_oferta` IS NULL
---
    public function getPaquetesRegularesConInfoAdicional($userId = null)
    {
        $paquetes = $this->where('es_oferta !=', true)
                         ->orWhere('es_oferta', null)
                         ->findAll();