app/Models/UsuariosModel.php

SELECT *
FROM `usuarios`
---
    public function getUsuarios()
    {
        return $this->findAll();