app/Models/VentasModel.php

SELECT `ventas`.*, `paquetes`.`destino`, `paquetes`.`hotel`, `paquetes`.`transporte`, `paquetes`.`precio`, `paquetes`.`imagen`, `paquetes`.`dias` as `duracion`, `ventas`.`fecha_venta` as `fecha_compra`, `ventas`.`cantidad`
FROM `ventas`
LEFT JOIN `paquetes` ON `paquetes`.`id` = `ventas`.`id_paquete`
WHERE `ventas`.`id_usuario` = '5'
ORDER BY `ventas`.`fecha_venta` DESC
---
    public function getViajesUsuario($userId)
    {
        return $this->select('ventas.*, paquetes.destino, paquetes.hotel, paquetes.transporte, paquetes.precio, paquetes.imagen, paquetes.dias as duracion, ventas.fecha_venta as fecha_compra, ventas.cantidad')
                    ->join('paquetes', 'paquetes.id = ventas.id_paquete', 'left')
                    ->where('ventas.id_usuario', $userId)
                    ->orderBy('ventas.fecha_venta', 'DESC')
                    ->findAll();