app/Models/VentasModel.php

SELECT *
FROM `ventas`
---
    public function getVentas()
    {
        return $this->findAll();